{"inkVersion":19,"root":[["^I trudged through the forest, wind whipped my hair and chilled my skin.",{"#":"forest"},{"#":"Emilia"},"\n","^My legs ached, it was a torment I was quite familiar with. As a soldier I'd marched for days with no sleep, little food or water.","\n","^I'd fought for my country and when it was all over they tossed me aside like a blunted sword.",{"#":"forest"},{"#":"Fred"},"\n","^There was peace now, no one knew for how long. At least what the kings considered peace. We still had to pick up the pieces, restore the aftermath.",{"#":"forest"},{"#":"Emilia"},{"#":"Fred"},"\n","^For me there was no rest. Now I was just another man, I had no income, no food, no roof over my head. I was forced to move from town to town seeking refuge and work.",{"#":"forest"},{"#":"Fred"},"\n","^People were not as friendly as I'd hoped, but that was life.","\n","^I navigated rocky terrain, uncertain of my bearings. I spotted a stream and knew this was my chance. There were usually settlings by water sources, if I could get to the end of this one I would strike gold.",{"#":"forest"},"\n","^As I travelled my throat grew dry. The cold crisp water of the stream was so tempting. I'd been drinking stale water from my pack for days.",{"#":"path"},"\n","ev","str","^drink water from stream","/str","/ev",{"*":"0.c-0","flg":20},"ev","str","^drink water from pack","/str","/ev",{"*":"0.c-1","flg":20},{"c-0":["^ ",{"->":"drank_from_stream"},"\n",{"->":"0.g-0"},{"#f":5}],"c-1":["^ ",{"->":"shortcut_to_village"},"\n","ev",{"VAR?":"player_name"},"out","/ev","^? ",{"#":"Received"},"\n",{"->":"0.g-0"},{"#f":5}],"g-0":["done",{"#f":5}]}],"done",{"drank_from_stream":["^It's running water, of course it's safe. And what's the point in wasting the water in my pack when there's fresh water here. I crouch down, cup my hands together and drink deeply from the stream. ","end","\n",{"#f":1}],"shortcut_to_village":["^Of course I don't know the quality of the water, what minerals have been deposited in it. If a goat has taken a shit in it recently. Even if it is running water, I'd rather not take the risk right now.","\n","^I arrived at a village. It's tiny, only a handful of buildings and huts. It has a quaint feel to it. Something about it sent a shiver down my spine. Quaint but unsettlingly quiet.","\n","^I better go to the inn, talk to the barkeeper, they always know what's going on, I'm sure they can direct me to someone who needs work.","\n",{"->":"inn"},{"#f":1}],"inn":["^The inn was small, the smallest I've seen, and lit by many candles. A couple of men huddled over thick oak tables, which resembled slabs of wood slapped onto wooden pillars rather than furniture. There was minimal decoration, everything was crudely designed, made for utility rather than decoration.","\n","^The only woman is the barmaid who was very modestly dressed, she had a matronly air about her. I couldn't imagine her luring in men with her appearance and flirtatious manner. She must have been the barkeeper's wife.","\n",{"->":"at_the_inn_01"},{"#f":1}],"at_the_inn_01":[[["ev",{"^->":"at_the_inn_01.0.0.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":18},{"s":["^Buy a drink ",{"->":"$r","var":true},null]}],["ev",{"^->":"at_the_inn_01.0.1.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":18},{"s":["^Talk to the barkeeper ",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"at_the_inn_01.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.0.s"},[{"#n":"$r2"}],"\n","^I passed the barkeeper a coin and he poured me a mug of dark liquid. I took a sip. It was slighlty sweet, fruity and a bit earthy. It was probably the best ale I'd ever had.","\n",{"->":".^.^.^"},{"#f":5}],"c-1":["ev",{"^->":"at_the_inn_01.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.1.s"},[{"#n":"$r2"}],"\n","ev",{"VAR?":"player_name"},"out","/ev","^: \"Hello good man, what do they call you?\"","\n","^???: \"I won't be giving my name to no stranger\"","\n","ev",{"VAR?":"player_name"},"out","/ev","^: \"Well that can easily be sorted, I'm ","ev",{"VAR?":"player_name"},"out","/ev","^, I was a soldier.\"","\n","^I show him the cheap coppery medal they gave me as some kind of shit compensation","\n","^???: Well I suppose it won't hurt to tell you, I'm ","ev",{"VAR?":"barkeeper"},"out","/ev","\n","ev",{"VAR?":"player_name"},"out","/ev","^: Nice to meet you sir","\n","ev",{"VAR?":"barkeeper"},"out","/ev","^: There's no work here, maybe check the farmhouse, they always need an extra pair of hands. But you'll get little coin, we're not rich folk around here.","\n","ev",{"VAR?":"player_name"},"out","/ev","^: That's ok, I just need a roof over my head.","\n","ev",{"VAR?":"barkeeper"},"out","/ev","^: I'd sort it out quickly if I were you, it gets dark fast over here.","\n","^I wonder what he means.","\n","ev",{"VAR?":"barkeeper"},"out","/ev","^: You might want to visit the apothecary first, buy your medicine.","\n",{"->":"barkeep_explains"},{"#f":5}]}],{"#f":1}],"barkeep_explains":[["ev",{"CNT?":"drank_from_stream"},"!","/ev",{"*":".^.c-0","flg":25},{"c-0":[{"->":"ignorant_of_curse"},"\n",{"->":"ignorant_of_curse"},{"#f":5}]}],{"#f":1}],"ignorant_of_curse":[["ev",{"VAR?":"player_name"},"out","/ev","^: I think you're mistaken sir, I'm not sick","\n","ev",{"VAR?":"barkeeper"},"out","/ev","^: You don't know? Well you see the water here is slightly poisonous, so we take this medicine and it stops us from getting sick","\n","^I wasn't sure what to say, perhaps he was making fun of me. I'd never heard of such a thing.","\n","ev",{"VAR?":"barkeeper"},"out","/ev","^: Don't you worry, once you take your medicine it'll be fine.","\n","^I still couldn't tell if he was taking the piss or not. But it was getting dark and I had no time to loiter.","\n","ev","str","^Go to farmhouse","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Go to apothecary","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":[{"->":"farmhouse_01"},"\n",{"#f":5}],"c-1":[{"->":"apothecary_01"},"\n",{"#f":5}]}],{"#f":1}],"apothecary_01":["^The barkeeper's comments had piqued my interest, so I rushed straight to the apothecary.","\n","end",{"#f":1}],"church_01":["end",{"#f":1}],"farmhouse_01":["^Work and a roof over my head was still the most important thing on my mind so I rushed to the farmhouse.","\n","end",{"#f":1}],"global decl":["ev","str","^Lydia","/str",{"VAR=":"player_name"},"str","^Fred","/str",{"VAR=":"barkeeper"},"str","^Mabel","/str",{"VAR=":"barkeeper_wife"},"str","^Emilia","/str",{"VAR=":"herbalist"},"str","^Father Gregor","/str",{"VAR=":"priest"},"str","^Kasien","/str",{"VAR=":"wizard"},"/ev","end",null],"#f":1}],"listDefs":{}}